# Manipulação EDA da base de dados Titanic

## Importando pacotes e bibliotecas

In [1]:
from matplotlib import pyplot as plt
import seaborn as sas
import pandas as pd
import numpy as np
#---
from utils.tratar_dados import *
from utils.funcoes_graficas import *

## Importando base de dados

### Importando de um .csv

In [2]:
file_name = "titanic"
titanic_dataframe = read_data(file_name)

Read from .pkl file format

### Importando de um .pkl

In [3]:
file_name = "titanic"
titanic_dataframe = read_data(file_name)

Read from .pkl file format

## Tratamento dos dados

### Passando os títulos para minúsculo

In [4]:
titulos = titanic_dataframe.columns
titulos = fix_header_to_standarts(titulos)
titanic_dataframe.columns = titulos

### Remoção de espaços

In [5]:
# Nao foi necessario

### Remoção de caracteres proibidos

In [6]:
# Nao foi necessario

### Normalização dos dados

In [7]:
titanic_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerid  418 non-null    int64
 1   survived     418 non-null    int64
 2   pclass       418 non-null    int64
 3   name         418 non-null    object
 4   sex          418 non-null    object
 5   age          332 non-null    float64
 6   sibsp        418 non-null    int64
 7   parch        418 non-null    int64
 8   ticket       418 non-null    object
 9   fare         417 non-null    float64
 10  cabin        91 non-null     object
 11  embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [8]:
titanic_dataframe.sample(10)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
390,1282,0,1,"Payne, Mr. Vivian Ponsonby",male,23.0,0,0,12749,93.5000,B24,S
410,1302,1,3,"Naughton, Miss. Hannah",female,NaN,0,0,365237,7.7500,NaN,Q
332,1224,0,3,"Thomas, Mr. Tannous",male,NaN,0,0,2684,7.2250,NaN,C
293,1185,0,1,"Dodge, Dr. Washington",male,53.0,1,1,33638,81.8583,A34,S
200,1092,1,3,"Murphy, Miss. Nora",female,NaN,0,0,36568,15.5000,NaN,Q
207,1099,0,2,"Collett, Mr. Sidney C Stuart",male,24.0,0,0,28034,10.5000,NaN,S
221,1113,0,3,"Reynolds, Mr. Harold J",male,21.0,0,0,342684,8.0500,NaN,S
397,1289,1,1,"Frolicher-Stehli, Mrs. Maxmillian (Margaretha ...",female,48.0,1,1,13567,79.2000,B41,C
412,1304,1,3,"Henriksson, Miss. Jenny Lovisa",female,28.0,0,0,347086,7.7750,NaN,S
263,1155,1,3,"Klasen, Miss. Gertrud Emilia",female,1.0,1,1,350405,12.1833,NaN,S

#### Tratamento de NaNs

##### Coluna "cabin"

In [9]:
coluna_cabine = "cabin"
for coluna in titanic_dataframe.columns:
    if coluna_cabine == coluna:
        titanic_dataframe[f"{coluna}"] = titanic_dataframe[f"{coluna}"].fillna("unknown")


titanic_dataframe.sample(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
231,1123,1,1,"Willard, Miss. Constance",female,21.0,0,0,113795,26.5500,unknown,S
366,1258,0,3,"Caram, Mr. Joseph",male,NaN,1,0,2689,14.4583,unknown,C
340,1232,0,2,"Fillbrook, Mr. Joseph Charles",male,18.0,0,0,C.A. 15185,10.5000,unknown,S
49,941,1,3,"Coutts, Mrs. William (Winnie Minnie"" Treanor)""",female,36.0,0,2,C.A. 37671,15.9000,unknown,S
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,unknown,Q

In [11]:
titanic_dataframe.cabin = fix_header_to_standarts(titanic_dataframe.cabin.values)

##### Coluna "age"

In [12]:
coluna_cabine = "age"
media = int(round(titanic_dataframe.age.mean(), 0))

for coluna in titanic_dataframe.columns:
    if coluna_cabine == coluna:
        titanic_dataframe[f"{coluna}"] = titanic_dataframe[f"{coluna}"].fillna(media)


titanic_dataframe.sample(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
338,1230,0,2,"Denbury, Mr. Herbert",male,25.0,0,0,C.A. 31029,31.5000,unknown,S
417,1309,0,3,"Peter, Master. Michael J",male,30.0,1,1,2668,22.3583,unknown,C
296,1188,1,2,"Laroche, Miss. Louise",female,1.0,1,2,SC/Paris 2123,41.5792,unknown,C
249,1141,1,3,"Khalil, Mrs. Betros (Zahie Maria"" Elias)""",female,30.0,1,0,2660,14.4542,unknown,C
290,1182,0,1,"Rheims, Mr. George Alexander Lucien",male,30.0,0,0,PC 17607,39.6000,unknown,S

##### Coluna "embarked"

In [13]:
titanic_dataframe.embarked.unique()

array(['Q', 'S', 'C'], dtype=object)

In [14]:
# NAO EXECUTE ESSA CELUNA MAIS DE UMA UNICA VEZ
titanic_dataframe.embarked = titanic_dataframe.embarked.map({
    "C": 0,
    "Q": 1,
    "S": 2
    }
)

In [15]:
titanic_dataframe.sample(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
100,992,1,1,"Stengel, Mrs. Charles Emil Henry (Annie May Mo...",female,43.0,1,0,11778,55.4417,c116,0
209,1101,0,3,"Delalic, Mr. Redjo",male,25.0,0,0,349250,7.8958,unknown,2
229,1121,0,2,"Hocking, Mr. Samuel James Metcalfe",male,36.0,0,0,242963,13.0000,unknown,2
131,1023,0,1,"Gracie, Col. Archibald IV",male,53.0,0,0,113780,28.5000,c51,0
387,1279,0,2,"Ashby, Mr. John",male,57.0,0,0,244346,13.0000,unknown,2

##### Coluna "sex"

In [ ]:
titanic_dataframe.sex.unique()

In [16]:
# NAO EXECUTE ESSA CELUNA MAIS DE UMA UNICA VEZ
titanic_dataframe.sex = titanic_dataframe.sex.map({
    "male": 0,
    "female": 1
    }
)

In [17]:
titanic_dataframe.sample(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
78,970,0,2,"Aldworth, Mr. Charles Augustus",0,30.0,0,0,248744,13.00,unknown,2
190,1082,0,2,"Angle, Mr. William A",0,34.0,1,0,226875,26.00,unknown,2
70,962,1,3,"Mulvihill, Miss. Bertha E",1,24.0,0,0,382653,7.75,unknown,1
43,935,1,2,"Corbett, Mrs. Walter H (Irene Colvin)",1,30.0,0,0,237249,13.00,unknown,2
93,985,0,3,"Guest, Mr. Robert",0,30.0,0,0,376563,8.05,unknown,2

#### Tratamento de tipos

In [18]:
id_max = titanic_dataframe.passengerid.max()
fare_max = round(titanic_dataframe.fare.max(), 2)
print(f"O maior id é:\t\t{id_max}\nA maior tarifa é:\t{fare_max}\n")

O maior id é:		1309
A maior tarifa é:	512.33

In [19]:
### coluna passengerid
titanic_dataframe.passengerid = titanic_dataframe.passengerid.astype("uint16")

### coluna survided
titanic_dataframe.survived = titanic_dataframe.survived.astype("uint8")

### coluna pclass
titanic_dataframe.pclass = titanic_dataframe.pclass.astype("uint8")

### coluna name
titanic_dataframe.name = titanic_dataframe.name.astype("category")

### coluna sex
titanic_dataframe.sex = titanic_dataframe.sex.astype("uint8")

### coluna age
titanic_dataframe.age = titanic_dataframe.age.astype("uint8")

### coluna sibsp
titanic_dataframe.sibsp = titanic_dataframe.sibsp.astype("uint8")

### coluna parch
titanic_dataframe.parch = titanic_dataframe.parch.astype("uint8")

### coluna ticket
titanic_dataframe.ticket = titanic_dataframe.ticket.astype("category")

### coluna fare
titanic_dataframe.fare = titanic_dataframe.fare.astype("float16")

### coluna cabin
titanic_dataframe.cabin = titanic_dataframe.cabin.astype("category")

### coluna embarked
titanic_dataframe.embarked = titanic_dataframe.embarked.astype("uint8")

In [20]:
titanic_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerid  418 non-null    uint16
 1   survived     418 non-null    uint8
 2   pclass       418 non-null    uint8
 3   name         418 non-null    category
 4   sex          418 non-null    uint8
 5   age          418 non-null    uint8
 6   sibsp        418 non-null    uint8
 7   parch        418 non-null    uint8
 8   ticket       418 non-null    category
 9   fare         417 non-null    float16
 10  cabin        418 non-null    category
 11  embarked     418 non-null    uint8
dtypes: category(3), float16(1), uint16(1), uint8(7)
memory usage: 39.7 KB